### AWS UAT App plan Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/b9ce52c3-bc14-4003-9150-e77fb3de2fa2/terraform-bin show -no-color plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-b2b111e4.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/About-b2b111e4.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-e0442dce.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/ArticleLayouts-e0442dce.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-4f38065c.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Articles-4f38065c.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-eaf6275a.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Landing-eaf6275a.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-8e379427.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/PDF-8e379427.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-b54dfad9.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/Start-b54dfad9.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-139e3675.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/StartNav-139e3675.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-75e00e53.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/app-75e00e53.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-49de4352.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/index.es-49de4352.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-1c7b97b0.js"] has changed
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "assets/jquery.easing-1c7b97b0.js"
      + metadata               = {}
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "about.html"
      ~ source_hash            = "6f44660556ddd53dc5f6e0ac850dc2bc" -> "4c1bab361505e651ea7c48bbd8aece1d"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles.html"
      ~ source_hash            = "9d36fced006090c98d2f60346bc0ce8b" -> "02e62c5534753c4ad9985976d27800bd"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-en.html"
      ~ source_hash            = "1eb2d3a29786c6e04c6486a432103cd5" -> "7db023401bfd713e8734cca225c919f1"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "articles/learning-to-unit-test-es.html"
      ~ source_hash            = "9eda5db27ec59fdf28c2410c57672fb4" -> "e8885ccae011fa66f26c417e8b6d0cbf"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-9a2db7dc.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/About-9a2db7dc.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/About-9a2db7dc.js"
      + source_hash            = "3410d745b2a5c79b2aff8910d4e05a17"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-b2b111e4.js"] will be destroyed
  # (because key ["assets/About-b2b111e4.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "5b050c5a9c0fe3a6d744add87b32933e" -> null
      - force_destroy          = true -> null
      - id                     = "assets/About-b2b111e4.js" -> null
      - key                    = "assets/About-b2b111e4.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/About-b2b111e4.js" -> null
      - source_hash            = "5b050c5a9c0fe3a6d744add87b32933e" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-be9305fd.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/ArticleLayouts-be9305fd.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/ArticleLayouts-be9305fd.js"
      + source_hash            = "c0fbf102bde80086716a75890e0d4586"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-e0442dce.js"] will be destroyed
  # (because key ["assets/ArticleLayouts-e0442dce.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f79258d463f0146248630258a319c2bc" -> null
      - force_destroy          = true -> null
      - id                     = "assets/ArticleLayouts-e0442dce.js" -> null
      - key                    = "assets/ArticleLayouts-e0442dce.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/ArticleLayouts-e0442dce.js" -> null
      - source_hash            = "f79258d463f0146248630258a319c2bc" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-4f38065c.js"] will be destroyed
  # (because key ["assets/Articles-4f38065c.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "ed3e79b559681bde95283db2cdb5f4ff" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Articles-4f38065c.js" -> null
      - key                    = "assets/Articles-4f38065c.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Articles-4f38065c.js" -> null
      - source_hash            = "ed3e79b559681bde95283db2cdb5f4ff" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-e5c4d4ef.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Articles-e5c4d4ef.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Articles-e5c4d4ef.js"
      + source_hash            = "ef0b55ead51771e81825455db622455f"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-61a40d7f.css"] will be destroyed
  # (because key ["assets/Landing-61a40d7f.css"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "text/css" -> null
      - etag                   = "4b4b60871b0c8cdca6fcf9d7e9188891" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-61a40d7f.css" -> null
      - key                    = "assets/Landing-61a40d7f.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-61a40d7f.css" -> null
      - source_hash            = "4b4b60871b0c8cdca6fcf9d7e9188891" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-c8c22ab0.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Landing-c8c22ab0.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Landing-c8c22ab0.js"
      + source_hash            = "23cc3960e613b43912a99fd68c72b7f0"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-eaf6275a.js"] will be destroyed
  # (because key ["assets/Landing-eaf6275a.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "e17e97f9b0ae2ce2333c4a421f1de774" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Landing-eaf6275a.js" -> null
      - key                    = "assets/Landing-eaf6275a.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Landing-eaf6275a.js" -> null
      - source_hash            = "e17e97f9b0ae2ce2333c4a421f1de774" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-8e379427.js"] will be destroyed
  # (because key ["assets/PDF-8e379427.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "7d1efdf8e797dfe032364614f37ba7a2" -> null
      - force_destroy          = true -> null
      - id                     = "assets/PDF-8e379427.js" -> null
      - key                    = "assets/PDF-8e379427.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/PDF-8e379427.js" -> null
      - source_hash            = "7d1efdf8e797dfe032364614f37ba7a2" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-c2eec551.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/PDF-c2eec551.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/PDF-c2eec551.js"
      + source_hash            = "4d50244446fd9fd4455d79dc0acc3c85"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-61a40d7f.css"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "text/css"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-61a40d7f.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-61a40d7f.css"
      + source_hash            = "4b4b60871b0c8cdca6fcf9d7e9188891"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-b54dfad9.js"] will be destroyed
  # (because key ["assets/Start-b54dfad9.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "6c874cdc7f0d1f41b3c05c07c0e0abe0" -> null
      - force_destroy          = true -> null
      - id                     = "assets/Start-b54dfad9.js" -> null
      - key                    = "assets/Start-b54dfad9.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/Start-b54dfad9.js" -> null
      - source_hash            = "6c874cdc7f0d1f41b3c05c07c0e0abe0" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-e6442b44.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/Start-e6442b44.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/Start-e6442b44.js"
      + source_hash            = "88487daab9d84234c580b59bc34cd616"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-139e3675.js"] will be destroyed
  # (because key ["assets/StartNav-139e3675.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "5e97c7e0708883d62d42891789274ae3" -> null
      - force_destroy          = true -> null
      - id                     = "assets/StartNav-139e3675.js" -> null
      - key                    = "assets/StartNav-139e3675.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/StartNav-139e3675.js" -> null
      - source_hash            = "5e97c7e0708883d62d42891789274ae3" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-3edd60b6.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/StartNav-3edd60b6.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/StartNav-3edd60b6.js"
      + source_hash            = "e2437a127f4a323638f2879f50bc80e2"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-75e00e53.js"] will be destroyed
  # (because key ["assets/app-75e00e53.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "b94fc7c2524ff0b5f0b2ef40a6278a91" -> null
      - force_destroy          = true -> null
      - id                     = "assets/app-75e00e53.js" -> null
      - key                    = "assets/app-75e00e53.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/app-75e00e53.js" -> null
      - source_hash            = "b94fc7c2524ff0b5f0b2ef40a6278a91" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-e2841901.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/app-e2841901.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/app-e2841901.js"
      + source_hash            = "0bbcf79c67dfceec92ccf526f92cac18"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-0e5d6001.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/index.es-0e5d6001.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/index.es-0e5d6001.js"
      + source_hash            = "4641a91051f874c79d6225a8a1db0e81"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-49de4352.js"] will be destroyed
  # (because key ["assets/index.es-49de4352.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "cd575fc59030b6031b7a64f5239f4672" -> null
      - force_destroy          = true -> null
      - id                     = "assets/index.es-49de4352.js" -> null
      - key                    = "assets/index.es-49de4352.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/index.es-49de4352.js" -> null
      - source_hash            = "cd575fc59030b6031b7a64f5239f4672" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-1c7b97b0.js"] will be destroyed
  # (because key ["assets/jquery.easing-1c7b97b0.js"] is not in for_each map)
  - resource "aws_s3_bucket_object" "this" {
      - acl                    = "private" -> null
      - bucket                 = "uat.shortpoet.com" -> null
      - bucket_key_enabled     = false -> null
      - cache_control          = "max-age=31536000, immutable" -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f3d9b4de10eee1a4926efb0f3b6f3318" -> null
      - force_destroy          = true -> null
      - id                     = "assets/jquery.easing-1c7b97b0.js" -> null
      - key                    = "assets/jquery.easing-1c7b97b0.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./../../../../../app/build/assets/jquery.easing-1c7b97b0.js" -> null
      - source_hash            = "f3d9b4de10eee1a4926efb0f3b6f3318" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
      - tags_all               = {
          - "Bucket"          = "uat.shortpoet.com"
          - "CloudFlare"      = "true"
          - "CloudFlare_Zone" = "shortpoet.com"
          - "Project"         = "sp"
          - "Terraform"       = "true"
        } -> null
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-894e0459.js"] will be created
  + resource "aws_s3_bucket_object" "this" {
      + acl                    = "private"
      + bucket                 = "uat.shortpoet.com"
      + bucket_key_enabled     = (known after apply)
      + cache_control          = "max-age=31536000, immutable"
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = true
      + id                     = (known after apply)
      + key                    = "assets/jquery.easing-894e0459.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./../../../../../app/build/assets/jquery.easing-894e0459.js"
      + source_hash            = "c1039c71154f67b886d5d2b3dc629a0e"
      + storage_class          = "STANDARD"
      + tags                   = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + tags_all               = {
          + "Bucket"          = "uat.shortpoet.com"
          + "CloudFlare"      = "true"
          + "CloudFlare_Zone" = "shortpoet.com"
          + "Project"         = "sp"
          + "Terraform"       = "true"
        }
      + version_id             = (known after apply)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "index.html"
      ~ source_hash            = "4138c680c0d56504a3ebefa87f40b40f" -> "c53036ca75678f5abb3991e2d381a8c2"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["pdf.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "pdf.html"
      ~ source_hash            = "9dfe31a4fdf24121bb1bfc5a69a8bcc9" -> "08dae08d956af09141660101e6698bcc"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["resume.html"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "resume.html"
      ~ source_hash            = "33bec3661d301eb046859dcbe5e0bd80" -> "119a111c0bcb81f3ec0ed2dfc99d5edf"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["sitemap.xml"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "sitemap.xml"
      ~ source_hash            = "b754ae7c877f8633cf26f7bd3877fcd7" -> "31e111431b36276fbdd974b5e837cdf1"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.s3_object_uat.aws_s3_bucket_object.this["ssr-manifest.json"] will be updated in-place
  ~ resource "aws_s3_bucket_object" "this" {
        id                     = "ssr-manifest.json"
      ~ source_hash            = "45660e3c355a528a33ca6c92ff93ad38" -> "8e83079ef32c9b10da134840ff63d6ee"
        tags                   = {
            "Bucket"          = "uat.shortpoet.com"
            "CloudFlare"      = "true"
            "CloudFlare_Zone" = "shortpoet.com"
            "Project"         = "sp"
            "Terraform"       = "true"
        }
      + version_id             = (known after apply)
        # (13 unchanged attributes hidden)
    }

Plan: 11 to add, 9 to change, 11 to destroy.

Changes to Outputs:
  ~ s3_bucket_object_etags       = [
        # (4 unchanged elements hidden)
        "9eda5db27ec59fdf28c2410c57672fb4",
      - "9660c17174819ae6370b6a81cbde7ae8",
      - "14502766ffff0341ecb5c3a2bf43a52d",
      - "ef10a60632f2d2025109f17a07ebd609",
      + (known after apply),
      + (known after apply),
        "d254e9f4850a323e5ea30df3ac31964d",
      - "4b4b60871b0c8cdca6fcf9d7e9188891",
      - "1bde4d78037a7906d55ad2ba510da9ba",
      - "bef2070070b3c92751c8d60a0ba6e8b7",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "6fc87daab214fb58303b3d530c9b2001",
      - "c5a8afa4aab2b9580cd1fff6aee86d12",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "35bc2af385e37e6def98966cb8b61301",
      - "6bb1f90b34404a8fe504344d49f52555",
      - "8fd09ed957ffa386226fbab3fa3028fa",
      + (known after apply),
        "e60911495dba8bb96def57539a94e9cf",
        # (16 unchanged elements hidden)
        "4936e3453a7e6bff7c1db8961e8c9697",
      - "370cb46de09983ac305f8c9ca4fee271",
      - "73f831a761537a8f5e5e8a14028e5516",
      + (known after apply),
      + (known after apply),
        "3af47f89e61fe763b909c1fabc4c4083",
        # (16 unchanged elements hidden)
        "b754ae7c877f8633cf26f7bd3877fcd7",
      - "aec4b0c74bc1f3718d3d7cbde96bd46c",
      + "45660e3c355a528a33ca6c92ff93ad38",
    ]
  ~ s3_bucket_object_ids         = [
        # (4 unchanged elements hidden)
        "articles/learning-to-unit-test-es.html",
      - "assets/About-3ba96643.js",
      - "assets/ArticleLayouts-e38d4328.js",
      - "assets/Articles-4ed255e1.js",
      + (known after apply),
      + (known after apply),
        "assets/Articles-cdca7afd.css",
      - "assets/Landing-61a40d7f.css",
      - "assets/Landing-e7f47360.js",
      - "assets/PDF-129c029a.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/PDF-ed9e0e67.css",
      - "assets/Start-991941bf.js",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "assets/StartNav-cb1e6734.css",
      - "assets/StartNav-f59d2d27.js",
      - "assets/app-be4ea729.js",
      + (known after apply),
        "assets/azure_devicon_forest_green-ee780a3a.svg",
        # (16 unchanged elements hidden)
        "assets/index-2883df99.css",
      - "assets/index.es-b1e87f1f.js",
      - "assets/jquery.easing-c9a7c047.js",
      + (known after apply),
      + (known after apply),
        "assets/powershell_devicon_forest_green-f06a1fda.svg",
        # (18 unchanged elements hidden)
    ]
  ~ s3_bucket_object_keys_ids    = [
        # (4 unchanged elements hidden)
        {
            id  = "articles/learning-to-unit-test-es.html"
            key = "articles/learning-to-unit-test-es.html"
        },
      ~ {
          ~ id  = "assets/About-3ba96643.js" -> (known after apply)
          ~ key = "assets/About-3ba96643.js" -> "assets/About-9a2db7dc.js"
        },
      ~ {
          ~ id  = "assets/ArticleLayouts-e38d4328.js" -> (known after apply)
          ~ key = "assets/ArticleLayouts-e38d4328.js" -> "assets/ArticleLayouts-be9305fd.js"
        },
      - {
          - id  = "assets/Articles-4ed255e1.js"
          - key = "assets/Articles-4ed255e1.js"
        },
        {
            id  = "assets/Articles-cdca7afd.css"
            key = "assets/Articles-cdca7afd.css"
        },
      ~ {
          ~ id  = "assets/Landing-61a40d7f.css" -> (known after apply)
          ~ key = "assets/Landing-61a40d7f.css" -> "assets/Articles-e5c4d4ef.js"
        },
      ~ {
          ~ id  = "assets/Landing-e7f47360.js" -> (known after apply)
          ~ key = "assets/Landing-e7f47360.js" -> "assets/Landing-c8c22ab0.js"
        },
      ~ {
          ~ id  = "assets/PDF-129c029a.js" -> (known after apply)
          ~ key = "assets/PDF-129c029a.js" -> "assets/PDF-c2eec551.js"
        },
        {
            id  = "assets/PDF-ed9e0e67.css"
            key = "assets/PDF-ed9e0e67.css"
        },
      ~ {
          ~ id  = "assets/Start-991941bf.js" -> (known after apply)
          ~ key = "assets/Start-991941bf.js" -> "assets/Start-61a40d7f.css"
        },
      + {
          + id  = (known after apply)
          + key = "assets/Start-e6442b44.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/StartNav-3edd60b6.js"
        },
        {
            id  = "assets/StartNav-cb1e6734.css"
            key = "assets/StartNav-cb1e6734.css"
        },
      ~ {
          ~ id  = "assets/StartNav-f59d2d27.js" -> (known after apply)
          ~ key = "assets/StartNav-f59d2d27.js" -> "assets/app-e2841901.js"
        },
      - {
          - id  = "assets/app-be4ea729.js"
          - key = "assets/app-be4ea729.js"
        },
        {
            id  = "assets/azure_devicon_forest_green-ee780a3a.svg"
            key = "assets/azure_devicon_forest_green-ee780a3a.svg"
        },
        # (16 unchanged elements hidden)
        {
            id  = "assets/index-2883df99.css"
            key = "assets/index-2883df99.css"
        },
      ~ {
          ~ id  = "assets/index.es-b1e87f1f.js" -> (known after apply)
          ~ key = "assets/index.es-b1e87f1f.js" -> "assets/index.es-0e5d6001.js"
        },
      ~ {
          ~ id  = "assets/jquery.easing-c9a7c047.js" -> (known after apply)
          ~ key = "assets/jquery.easing-c9a7c047.js" -> "assets/jquery.easing-894e0459.js"
        },
        {
            id  = "assets/powershell_devicon_forest_green-f06a1fda.svg"
            key = "assets/powershell_devicon_forest_green-f06a1fda.svg"
        },
        # (18 unchanged elements hidden)
    ]
  ~ s3_bucket_object_version_ids = [
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
        "",
        # (16 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (5 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (3 unchanged elements hidden)
        "",
      + (known after apply),
        "",
        "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      - "",
      + (known after apply),
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-b2b111e4.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/About-b2b111e4.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-e0442dce.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/ArticleLayouts-e0442dce.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-4f38065c.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Articles-4f38065c.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-eaf6275a.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Landing-eaf6275a.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-8e379427.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/PDF-8e379427.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-b54dfad9.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Start-b54dfad9.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-139e3675.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/StartNav-139e3675.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-75e00e53.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/app-75e00e53.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-49de4352.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/index.es-49de4352.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-1c7b97b0.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/jquery.easing-1c7b97b0.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "about.html"%0A      ~ source_hash            = "6f44660556ddd53dc5f6e0ac850dc2bc" -> "4c1bab361505e651ea7c48bbd8aece1d"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles.html"%0A      ~ source_hash            = "9d36fced006090c98d2f60346bc0ce8b" -> "02e62c5534753c4ad9985976d27800bd"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles/learning-to-unit-test-en.html"%0A      ~ source_hash            = "1eb2d3a29786c6e04c6486a432103cd5" -> "7db023401bfd713e8734cca225c919f1"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "articles/learning-to-unit-test-es.html"%0A      ~ source_hash            = "9eda5db27ec59fdf28c2410c57672fb4" -> "e8885ccae011fa66f26c417e8b6d0cbf"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-9a2db7dc.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/About-9a2db7dc.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/About-9a2db7dc.js"%0A      + source_hash            = "3410d745b2a5c79b2aff8910d4e05a17"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-b2b111e4.js"] will be destroyed%0A  # (because key ["assets/About-b2b111e4.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "5b050c5a9c0fe3a6d744add87b32933e" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/About-b2b111e4.js" -> null%0A      - key                    = "assets/About-b2b111e4.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> n
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*